app/models/game.rb

SELECT `players`.* FROM `players` WHERE `players`.`id` = 14 LIMIT 1
---
  def winner_name
    Player.find_by(id: winner).name

SELECT `players`.* FROM `players` WHERE `players`.`id` = 20 LIMIT 1
---
  def loser_name
    Player.find_by(id: loser).name