app/models/player.rb

  def match_win_loss_ratio
    wins = 0
    loss = 0
    winners = Match.where(player_1_id: self.id).each.map(&:winner) + Match.where(player_2_id: self.id).each.map(&:winner)
    winners.each do |w|
---
SELECT `matches`.* FROM `matches` WHERE `matches`.`player_2_id` = 23

  def game_win_loss_ratio
    win = Game.where(winner: self.id).count
    loss = Game.where(loser: self.id).count
---
SELECT COUNT(*) FROM `games` WHERE `games`.`winner` = 32
SELECT COUNT(*) FROM `games` WHERE `games`.`loser` = 32

  def new_rank
    new_rank = active ? Player.all.sort_by(&:points).reverse.find_index(self) + 1 : 0
    self.update!(rank: new_rank)
---
UPDATE `players` SET `players`.`rank` = 27, `players`.`updated_at` = '2020-04-17 23:37:58.105847' WHERE `players`.`id` = 31

  def tournaments_played
    matches = Match.where(player_1_id: id) + Match.where(player_2_id: id)
    Tournament.where(id: (matches.map(&:tournament_id).uniq)).map(&:id)
---
SELECT `matches`.* FROM `matches` WHERE `matches`.`player_2_id` = 32
SELECT `tournaments`.* FROM `tournaments` WHERE `tournaments`.`id` = 1