app/models/tournament.rb

SELECT `players`.* FROM `players` WHERE `players`.`id` IS NULL LIMIT 1
---
  def winner_name
    Player.find_by(id: winner).name